Autodesk.Revit.DB.Toposolid.GetIntersectingElementData
Gets intersection data of all intersecting elements.
Returns:
The array of all intersecting element data.
Since:
2025

Autodesk.Revit.DB.Toposolid.SetSmoothedSurface(Autodesk.Revit.DB.Document,System.Boolean)
Set smoothed surface setting of Toposolid.
document:
The document.
enable:
True means enable smoothed surface setting, otherwise disable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Toposolid.IsSmoothedSurfaceEnabled(Autodesk.Revit.DB.Document)
Get smoothed surface setting of Toposolid.
document:
The document.
Returns:
True if smoothed surface is enabled for Toposolid, otherwise return false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Toposolid.CanBeExcavatedBy(Autodesk.Revit.DB.ElementId)
Checks if the given element can be used to excavate the toposolid.
elementId:
Id of the element
Returns:
True if the element can be used to excavate the toposolid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Toposolid.RemoveExcavationBy(Autodesk.Revit.DB.ElementId)
Remove the excavation between the given element and the toposolid.
elementId:
Id of the element that already excavates the toposolid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element is not supported for toposolid excavation operations.
Since:
2025

Autodesk.Revit.DB.Toposolid.ExcavateBy(Autodesk.Revit.DB.ElementId)
Excavates the toposolid by a given element.
elementId:
Id of the element used to excavate the toposolid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element is not supported for toposolid excavation operations.
Since:
2025

Autodesk.Revit.DB.Toposolid.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new instance of toposolid within the project.
document:
The document in which the new toposolid is created.
profiles:
An array of planar curve loops that represent the profiles of the toposolid.
points:
An array of points that used to construct the top face of the toposolid.
topoTypeId:
Id of the toposolid type to be used by the new toposolid.
levelId:
Id of the level on which the toposolid is to be placed.
Returns:
A new toposolid object within the project if successful.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve loops cannot compose a valid boundary, that means:
the "curveLoops" collection is empty;
or some curve loops intersect with each other;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the horizontal(XY) plane;
or input curves contain at least one helical curve.
-or-
The ElementId levelId is not a Level.
-or-
Toposolid type is not valid for this toposolid.
-or-
Input curves build invalid sketch.
-or-
Failed to create curve elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot generate a sketch.
-or-
Failed to create new element.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2024